"""作業1
輸入一數字n為尋找的區間範圍, 找出區間範圍
3,7的倍數顯示在螢幕上, 其餘不顯示
hint:可以使用%取餘數進行判斷
EX
請輸入正整數:20
3
6
7
9
12
14
15
18
"""
"""
作業2
請輸入要印出的箭頭大小
hint:
可利用字串乘法
>>>val="*" * 3
>>>print(val)
>>>***
EX:
請輸入要印出的箭頭大小:3
  *
 ***
*****
  *
  *
  *
"""
'''
作業一
'''
# x = int(input('請輸入一個開始的正整數'))
# y = int(input('請輸入一個結束的正整數'))  #數值要比x大
# for i in range(y - x + 1):
#     a = x % 3
#     if (a == 0):
#         print(x)  # 這時候i會從10
#     x = x + 1
'''
作業二
'''
a = int(input("請輸入要印出的箭頭大小"))
for i in range(1, a + 1):
    print(' ' * (a - i) + '*' * (2 * i - 1))
for j in range(1, a + 1):
    print(' ' * (a - 1) + '*')
